In [2]:
import pandas as pd

In [3]:
# Series
s = pd.Series([10, 20, 30], index=["a", "b", "c"])
print(s)

a    10
b    20
c    30
dtype: int64

In [4]:
# DataFrame from dictionary
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Kathmandu', 'Pokhara', 'Lalitpur']
})
print(df)

      Name  Age       City
0    Alice   25  Kathmandu
1      Bob   30    Pokhara
2  Charlie   35   Lalitpur

In [5]:
# Row access
print(df.iloc[0])        # by index
print(df.loc[1])         # by label

Name        Alice
Age            25
City    Kathmandu
Name: 0, dtype: object
Name        Bob
Age          30
City    Pokhara
Name: 1, dtype: object

In [6]:
# Column access
print(df['Name'])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [7]:
# Slicing
print(df[1:])            # rows from index 1 onwards

      Name  Age      City
1      Bob   30   Pokhara
2  Charlie   35  Lalitpur

In [8]:
# Filter using condition
print(df[df['Age'] > 28])

      Name  Age      City
1      Bob   30   Pokhara
2  Charlie   35  Lalitpur

In [9]:
# Multiple conditions
print(df[(df['Age'] > 25) & (df['City'] == 'Pokhara')])

  Name  Age     City
1  Bob   30  Pokhara

In [10]:
df['Salary'] = [50000, 60000, 70000]  # Add new column
print(df)

      Name  Age       City  Salary
0    Alice   25  Kathmandu   50000
1      Bob   30    Pokhara   60000
2  Charlie   35   Lalitpur   70000

In [11]:
df.drop('Salary', axis=1, inplace=True)  # Remove column
print(df)

      Name  Age       City
0    Alice   25  Kathmandu
1      Bob   30    Pokhara
2  Charlie   35   Lalitpur

In [12]:
print(df['Age'].mean())

30.0

In [13]:
print(df.describe())

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [14]:
print(df['Age'].value_counts())

Age
25    1
30    1
35    1
Name: count, dtype: int64

In [15]:
# By one column
print(df.sort_values('Age'))

      Name  Age       City
0    Alice   25  Kathmandu
1      Bob   30    Pokhara
2  Charlie   35   Lalitpur

In [16]:
# By multiple columns
print(df.sort_values(by=['City', 'Age'], ascending=[True, False]))

      Name  Age       City
0    Alice   25  Kathmandu
2  Charlie   35   Lalitpur
1      Bob   30    Pokhara

In [17]:
df['Department'] = ['IT', 'HR', 'IT']
grouped = df.groupby('Department')
print(grouped['Age'].mean())

Department
HR    30.0
IT    30.0
Name: Age, dtype: float64

In [18]:
df2 = pd.DataFrame({
    'A': [1, 2, None],
    'B': [4, None, 6]
})

In [19]:
# Fill NaN
print(df2.fillna(0))

     A    B
0  1.0  4.0
1  2.0  0.0
2  0.0  6.0

In [20]:
# Drop rows with NaN
print(df2.dropna())

     A    B
0  1.0  4.0

In [21]:
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['A', 'B']})
df2 = pd.DataFrame({'ID': [1, 2], 'Score': [90, 85]})

merged = pd.merge(df1, df2, on='ID')
print(merged)

   ID Name  Score
0   1    A     90
1   2    B     85

In [22]:
# CSV
df.to_csv("mydata.csv", index=False)

In [23]:
# Read CSV
new_df = pd.read_csv("mydata.csv")
print(new_df.head())

      Name  Age       City Department
0    Alice   25  Kathmandu         IT
1      Bob   30    Pokhara         HR
2  Charlie   35   Lalitpur         IT